from typing import List, Dict

types_list = ["Все", "Фильм", "Сериал", "Аниме", "Мультфильм", "Анимация"]

genre_list = ["Все", "Аниме", "Биография", "Боевик", "Вестерн", "Военный", "Детектив",
              "Детский", "Для Взрослых", "Документальный", "Драма", "Игра", "История",
              "Комедия", "Концерт", "Короткометражка", "Криминал", "Мелодрама", "Музыка",
              "Мультфильм", "Мюзикл", "Новости", "Приключения", "Реальное ТВ", "Семейный",
              "Спорт", "Ток-Шоу", "Триллер", "Ужасы", "Фантастика", "Фильм-Нуар", "Фэнтези", "Церемония"]

country_list = ["Все", "Россия", "США", "СССР", "Австралия", "Аргентина", "Беларусь", "Бельгия",
                "Болгария", "Боливия", "Бразилия", "Великобритания", "Германия", "Гонконг",
                "Испания", "Италия", "Казахстан", "Канада", "Китай", "Корея Южная", "Мексика",
                "Нидерланды", "Норвегия", "Польша", "Румыния", "Таиланд", "Турция", "Украина", "Франция", "Япония"]


sort_field_dict = {
    "Название ⬆": "name-",
    "Название ⬇": "name+",
    "Рейтинг ⬆": "rating.kp-",
    "Рейтинг ⬇": "rating.kp+",
    "Год ⬆": "year-",
    "Год ⬇": "year+",
}

sort_field_dict_revers = {
    "name-": "Название ⬆",
    "name+": "Название ⬇",
    "rating.kp-": "Рейтинг ⬆",
    "rating.kp+": "Рейтинг ⬇",
    "year-": "Год ⬆",
    "year+": "Год ⬇",
}


top_movie_dict_rus = {
    "Топ 250 фильмов": "top250",
    "Топ 250 сериалов": "series-top250",
    "Популярные фильмы": "popular-films",
    "Популярные сериалы": "popular-series",
    "Смотрим всей семьей": "hd-family",
    "Вселенная MARVEL": "marvel_universe",
    "Фильмы, которые стоит посмотреть": "hd-must-see",
}


top_movie_dict_eng = {
    "top250": "Топ 250 фильмов",
    "series-top250": "Топ 250 сериалов",
    "popular-films": "Популярные фильмы",
    "popular-series": "Популярные сериалы ",
    "hd-family": "Смотрим всей семьей",
    "marvel_universe": "Вселенная MARVEL",
    "hd-must-see": "Фильмы, которые стоит посмотреть",
}


premier_data_dict = {
    "Декабрь 2023": "01.12.2023-31.12.2023",
    "Январь 2024": "01.01.2024-31.01.2024",
    "Февраль 2024": "01.02.2024-29.02.2024",
    "Март 2024": "01.03.2024-31.03.2024",
    "Апрель 2024": "01.04.2024-30.04.2024",
    "Май 2024": "01.05.2024-31.05.2024",
    "Июнь 2024": "01.06.2024-30.06.2024",
    # "Июль 2024": "01.07.2024-31.07.2024",
    # "Август 2024": "01.08.2024-31.08.2024",
    # "Сентябрь 2024": "01.09.2024-30.09.2024",
    # "Октябрь 2024": "01.10.2024-31.10.2024",
    # "Ноябрь 2024": "01.11.2024-30.11.2024",
    # "Декабрь 2024": "01.12.2024-31.12.2024",
}

premier_data_dict_revers = {
    "01.12.2023-31.12.2023": "Декабрь 2023",
    "01.01.2024-31.01.2024": "Январь 2024",
    "01.02.2024-29.02.2024": "Февраль 2024",
    "01.03.2024-31.03.2024": "Март 2024",
    "01.04.2024-30.04.2024": "Апрель 2024",
    "01.05.2024-31.05.2024": "Май 2024",
    "01.06.2024-30.06.2024": "Июнь 2024",
    # "01.07.2024-31.07.2024": "Июль 2024",
    # "01.08.2024-31.08.2024": "Август 2024",
    # "01.09.2024-30.09.2024": "Сентябрь 2024",
    # "01.10.2024-31.10.2024": "Октябрь 2024",
    # "01.11.2024-30.11.2024": "Ноябрь 2024",
    # "01.12.2024-31.12.2024": "Декабрь 2024",
}


def get_types_list() -> List:
    """Функция возвращающая список типов"""
    return types_list


def get_genre_list() -> List:
    """Функция возвращающая список жанров"""
    return genre_list


def get_country_list() -> List:
    """Функция возвращающая список стран"""
    return country_list


def get_field_dict() -> Dict:
    """Функция возвращающая словарь (сортировка)"""
    return sort_field_dict


def get_field_dict_revers() -> Dict:
    """Функция возвращающая словарь (сортировка)"""
    return sort_field_dict_revers


def get_top_movie_dick_rus() -> Dict:
    """Функция возвращающая словарь (топ фильмов)"""
    return top_movie_dict_rus


def get_top_movie_dick_eng() -> Dict:
    """Функция возвращающая словарь (топ фильмов)"""
    return top_movie_dict_eng


def get_premier_date() -> Dict:
    """Функция возвращающая словарь (даты кинопремьер)"""
    return premier_data_dict


def get_premier_date_revers() -> Dict:
    """Функция возвращающая словарь (даты кинопремьер)"""
    return premier_data_dict_revers
